// Напишите программу, которая принимает на вход трёхзначное число
// и возводит 2ую цифру этого числа в степень, равную третьей цифры.
// Пример:
// 487 => 8^7
// 254 => 5^4
// 617 => 1^7

 

// int number = 10;
// number *= 10; // number = number * 10;
// System.Console.WriteLine(number);